S14-x2-speed-upwind-corr-vorticity-hisa-maxCo5-chamfer-Euler/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];
//#include        "include/freestreamConditions"
//internalField   uniform $Tinlet;

internalField   uniform 145.768159204;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 145.768159204;
//        type            fixedValue;
//        value        uniform   $Tinlet;
    }

    outlet
    {
        type            zeroGradient;
    }

    plate
    {
        type            zeroGradient;
    }

    above
    {
        type            symmetryPlane;
    }

    top
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
