S14-x2-speed-upwind-corr-vorticity-hisa-maxCo5-chamfer-Euler/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Convective flux (AUSMPlusUp, HLLC)
fluxScheme          AUSMPlusUp;
lowMachAusm         true;

ddtSchemes
{
    default         dualTime rPseudoDeltaT CrankNicolson 0.9;
}

gradSchemes
{
    default         faceLeastSquares linear;
}

divSchemes
{
}

laplacianSchemes
{
}

interpolationSchemes
{
    default         linear;
//    reconstruct(rho) wVanLeer;
//    reconstruct(U)  wVanLeer;
//    reconstruct(T)  wVanLeer;

    reconstruct(rho) vanAlbada;
    reconstruct(U)  vanAlbadaV;
    reconstruct(T)  vanAlbada;

//    reconstruct(rho) upwind;
//    reconstruct(U) upwind;
//    reconstruct(T) upwind;


}

snGradSchemes
{
}


// ************************************************************************* //
